{
  "pt": {
    "name": "Paulo Hasa",
    "greeting": "E aí! Eu sou",
    "professional": "Desenvolvedor",
    "fullstack": "Full Stack",
    "frontend": "Front-end",
    "backend": "Back-end",
    "home": "Inicio",
    "about": "Sobre mim",
    "project": "Projetos",
    "contact": "Contato",
    "experience": "Experiência",
    "about_me_one": "Sou desenvolvedor full stack com mais de 5 anos de experiência em desenvolvimento de software, com forte atuação em front-end, back-end e integração de APIs. Ao longo da minha carreira, trabalhei com princípios de DevOps, ajudando equipes a otimizar processos e implementações. Embora meu foco não seja banco de dados, tenho conhecimento na área e estou sempre buscando expandir minhas habilidades.",
    "about_me_two": "Tive a oportunidade de trabalhar em empresas e como freelancer, o que me permitiu lidar com diferentes desafios e necessidades de clientes. Uma experiência marcante foi meu trabalho em um escritório de contabilidade, onde atuei por mais de um ano com machine learning e automação de processos, ajudando a otimizar e transformar fluxos de trabalho internos.",
    "button_experience": "Explore Minha Trajetória",
    "button_projects": "Acesse Meus Projetos",
    "title_tecnologies": "Tecnologias que Domino",
    "title_experience": "Meu Caminho até Aqui",
    "title_projects": "Experiência em Ação",
    "title_on_ex":"Desenvolvedor Fullstack Sênior | React, Python e Django",
    "present": "Atual",
    "expand_btn": "Continuar lendo",
    "retract_btn": "Ver menos",
    "description_on": "Atualmente, estou trabalhando no desenvolvimento de uma plataforma inovadora que auxilia petrofísicos na interpretação de poços de petróleo por meio de Inteligência Artificial e Machine Learning. Minha responsabilidade principal é liderar o desenvolvimento do front-end da aplicação, garantindo interfaces intuitivas e eficientes, além de integrar APIs que suportam a comunicação entre os módulos da plataforma, contribuindo para uma análise rápida e precisa dos dados.",
    "title_plusoft_ex":"Desenvolvedor Python | Python, Django e Js",
    "description_plusoft": "Atuei no projeto iCustomer da Plusoft, uma plataforma que integrava, via API, as interações dos usuários em redes sociais com os clientes da empresa. Fui responsável tanto pela sustentação do sistema quanto pela implementação de novas funcionalidades, desenvolvidas a partir de sugestões dos clientes e da equipe interna. Contribuí para garantir a estabilidade, a performance e a evolução contínua da plataforma, sempre buscando soluções eficientes e alinhadas às necessidades dos usuários.",
    "title_roma_ex":"Analista de Automação e Machine Learning | VBA & Python",
    "description_roma": "No Grupo Roma, atuei na automação de sistemas, desenvolvendo scripts em Python e VBA para automatizar a inserção de dados de clientes no sistema interno da empresa. Trabalhei com diversas fontes de dados, como planilhas Excel, arquivos PDF e TXT, otimizando processos internos e facilitando o trabalho dos contadores. Além disso, prestei serviços externos, desenvolvendo microsistemas sob medida para pequenas empresas, sempre focando em eficiência, precisão e automação de tarefas repetitivas.",
    "title_free_ex":"Desenvolvedor Freelancer | Fullstack",
    "description_freelancer": "Com mais de 5 anos de experiência, crio aplicações web robustas, escaláveis e intuitivas, unindo interfaces elegantes no front-end e arquiteturas sólidas no back-end. Especializado em React.js, JavaScript, Python, Django, Docker e integração de APIs, ajudo empresas a alcançar seus objetivos através de soluções sob medida, com deploys ágeis e suporte contínuo. Se você busca alguém para transformar sua ideia em realidade digital, estou pronto para o desafio.",
    "title_freelancer": "Desenvolvedor Autonomo",
    "skills": "Competências",    
    "explore_project": "Explore o Projeto",
    "project_details_wellnova_title": "Análise Petrofísica com IA",
    "project_details_wellnova": "A plataforma Wellnova foi desenvolvida para auxiliar petrofísicos na interpretação da integridade do cimento em poços de petróleo. O projeto evoluiu para incluir visualização interativa de logs, simulações avançadas e outras funcionalidades essenciais, proporcionando uma experiência intuitiva e eficiente para os usuários. Neste projeto, sou responsável pelo desenvolvimento front-end e integração de APIs.",
    "project_details_digitalpm_title": "Gerenciamento de projetos",
    "project_details_digitalpm": "O Project Manager foi desenvolvido para atender à alta demanda e ao gerenciamento eficiente de projetos de P&D na Ouronova. A plataforma permite que os gestores administrem tanto a parte financeira quanto a equipe do projeto, complementando as funções de recursos humanos. Além disso, o sistema possibilita a realização de avaliações de desempenho, feedback contínuo e o controle completo do progresso dos projetos, incluindo a gestão rigorosa de prazos e entregas.",
    "project_details_decor_title": "Portfolio para Arquitetos",
    "project_details_decor": "A Decor foi concebida como uma rede social voltada para arquitetos, designers de interiores, paisagistas e outros profissionais da área, proporcionando uma plataforma exclusiva para conectar usuários a esses especialistas. Nessa plataforma, o usuário pode visualizar os projetos do profissional, juntamente com a região em que ele atende. Também implementamos, por meio de um banco de dados, a funcionalidade que permite aos profissionais divulgar seu trabalho utilizando e-mail marketing e outros meios, com foco em regiões específicas. Além disso, integramos lojas parceiras que fazem parte do portfólio do profissional, permitindo que o usuário visualize móveis e outros itens, com a opção de acessar diretamente o link da loja para realizar a compra. Neste projeto, atuei como desenvolvedor full stack, em colaboração com uma designer UX/UI, que idealizou a plataforma junto ao cliente.",
    "repository": "Repositórios",
    "text_vite": "Depois que conheci o Vite, ficou difícil voltar atrás. A velocidade no desenvolvimento, o hot reload instantâneo e a leveza no build fizeram toda a diferença no meu fluxo de trabalho. Com ele, deixei de perder tempo com esperas desnecessárias e passei a focar no que realmente importa: o desenvolvimento da aplicação. Hoje, todos os meus projetos React começam com Vite, e a experiência nunca foi tão fluida.",
    "text_react": "Em projetos onde atuo apenas no front-end e trabalho com APIs, o React é minha escolha pela sua agilidade na criação de interfaces dinâmicas e pela facilidade de integração com back-end. A gestão do estado de forma declarativa e a estrutura baseada em componentes tornam a manutenção e a escalabilidade mais simples. Além disso, sua grande comunidade e documentação garantem um desenvolvimento rápido e sem dificuldades.",
    "text_js": "Gosto de utilizar tanto para interações no front-end quanto para manipular dados enviados ao back-end. Em interações diretas com HTML + Django, uso JS para gerenciar e enviar dados de maneira eficiente. Além disso, em projetos com bibliotecas JS, posso realizar validações, manipulações dinâmicas de elementos e até mesmo integrar o front com APIs de forma fluida e ágil. JS é fundamental, pois permite construir uma experiência mais interativa, além de garantir o controle total sobre os dados que trafegam entre o front e o back.",
    "text_ts": "Eu comecei a usar o TypeScript em projetos freelancer e também na migração de sistemas existentes para um código mais robusto e seguro. A primeira coisa que me atraiu no TypeScript foi a capacidade de adicionar uma estrutura mais sólida ao código. Ao contrário do JavaScript, que é mais flexível e permite escrever código de diversas formas, o TypeScript traz uma abordagem mais organizada e com regras claras. Esse controle extra ajudou a melhorar a clareza do código e reduziu a quantidade de erros durante o desenvolvimento, especialmente em projetos mais complexos.",
    "text_ns": "Já trabalhei com o Next.js, principalmente dando manutenção em sistemas existentes e realizando integrações com o back-end em Django. O Next.js facilitou bastante o processo de criação de interfaces dinâmicas e otimizadas, enquanto a integração com o Django permitiu uma comunicação eficiente entre o front-end e o back-end. A combinação dos dois frameworks ajudou a entregar sistemas rápidos, escaláveis e bem estruturados, garantindo uma boa performance tanto no lado do cliente quanto no servidor.",
    "text_bootstrap": "O Bootstrap é minha biblioteca de CSS principal, e eu sempre a utilizo quando possível, principalmente pela sua responsividade e pela facilidade de integração em sistemas. Com o Bootstrap, consigo criar layouts flexíveis que se adaptam bem a diferentes tamanhos de tela, o que torna a experiência do usuário muito melhor. Além disso, a manipulação e customização de componentes são bem simples, o que acelera o desenvolvimento. A documentação robusta e a comunidade ativa também são grandes vantagens, garantindo que qualquer dúvida seja facilmente resolvida. Para mim, o Bootstrap é uma escolha certeira para projetos rápidos e com boa performance.",
    "text_tailwind": "Comecei a usar o Tailwind CSS recentemente em meus projetos freelancer para agilizar o desenvolvimento. A abordagem de classes utilitárias facilita a personalização rápida e direta no HTML, sem precisar escrever muito CSS. Isso acelera o processo e torna a manutenção do código mais simples. A integração com outros frameworks é tranquila e sua documentação completa torna a implementação ainda mais fácil.",
    "text_python": "Python foi a minha primeira linguagem prática, com a qual comecei a trabalhar. Iniciei minha carreira como analista de dados, atuando principalmente em análise de dados e automação de processos. Essa experiência me proporcionou uma base sólida para entender o fluxo de dados e otimizar operações. Com o tempo, migrei para a área de desenvolvimento, me tornando um dev fullstack, e aproveitei todo o conhecimento adquirido em Python para implementar soluções eficientes e escaláveis em meus projetos.",
    "text_nodejs": "Com Node.js, minha experiência foi voltada principalmente para a manutenção de sistemas, onde recebia tarefas de chamados de clientes e resolvia problemas relacionados à otimização de performance. Essa experiência me ajudou a entender profundamente as necessidades dos usuários e a melhorar a eficiência dos sistemas, garantindo um melhor desempenho e uma experiência mais fluida.",
    "text_django":"Comecei com Django trabalhando na manutenção de sistemas, mas atualmente meu foco é desenvolvimento back-end, especialmente integrando o front-end via APIs. Em meus projetos pessoais, opto por usar o Django como back-end devido à facilidade de trabalhar com as bibliotecas Python, a integração com bancos de dados e a agilidade na criação de CRDs de alta qualidade. Sua estrutura robusta e a simplicidade em implementar funcionalidades essenciais tornam o Django uma escolha eficiente para o desenvolvimento de sistemas completos e escaláveis.",
    "text_docker": "Utilizo Docker principalmente quando a aplicação envolve múltiplos processos e é necessário empacotar a aplicação para facilitar sua execução em diferentes ambientes. Esse recurso é especialmente útil quando atuo na manutenção de sistemas, pois permite isolar e integrar componentes de forma eficiente, garantindo que o ambiente de produção seja consistente e fácil de replicar.",
    "text_git": "Utilizo Git em todos os meus projetos, pois ele proporciona um controle eficiente de versões e facilita a colaboração em equipe. Com o Git, consigo gerenciar alterações no código de forma organizada, garantindo que o histórico de versões esteja sempre acessível e permitindo reverter modificações quando necessário. Essa prática é essencial para manter a qualidade e integridade do código durante o desenvolvimento.",
    "text_kubernets": "Atuei com Kubernetes realizando manutenção de sistemas e atendendo chamados de clientes. Nesse contexto, fui responsável por gerenciar e orquestrar containers, garantindo que os sistemas estivessem sempre disponíveis e operando de forma eficiente. A experiência com Kubernetes me permitiu otimizar o desempenho das aplicações e resolver problemas relacionados à escalabilidade e ao gerenciamento de recursos.",
    "text_github": "Utilizo GitHub como meu repositório principal devido ao seu excelente controle de versionamento e pelas facilidades que o sistema oferece. A plataforma facilita a colaboração em equipe, permitindo revisões de código com pull requests, além de integrar facilmente com ferramentas de CI/CD para automação de testes e deploys. O GitHub também oferece uma interface intuitiva para gerenciamento de projetos, além de ser uma ferramenta robusta para manter o código organizado e acessível.",
    "text_bitbuket": "Utilizei o Bitbucket como repositório empresarial em algumas das empresas nas quais atuei. A plataforma ofereceu uma solução robusta para o controle de versões e colaboração em equipe, com integração fácil a ferramentas de CI/CD. Além disso, o Bitbucket permitiu uma gestão eficiente dos projetos, com recursos como branching e pull requests, essenciais para garantir a qualidade e organização do código.",
    "level_basic": "básico",
    "level_inter": "Intermediário",
    "level_advan": "Avançado",
    "link_to_project": "Ver o Resultado",
    "link_unavailable":"Indisponível temporariamente"
  },

  "en": {
    "name": "Paulo Hasa",
    "greeting": "Hey! I'm",
    "professional": "Developer",
    "fullstack": "Full Stack",
    "frontend": "Front-end",
    "backend": "Back-end",
    "home": "Home",
    "about": "About Me",
    "project": "Projects",
    "contact": "Contact",
    "experience": "Experience",
    "about_me_one": "I'm a full stack developer with over 5 years of experience in software development, with strong expertise in front-end, back-end, and API integration. Throughout my career, I have worked with DevOps principles, helping teams optimize processes and implementations. Although databases aren't my primary focus, I have knowledge in the area and am always looking to expand my skills.",
    "about_me_two": "I have had the opportunity to work both in companies and as a freelancer, which has allowed me to handle different challenges and client needs. A notable experience was working at an accounting office, where I spent over a year working with machine learning and process automation, helping optimize and transform internal workflows.",
    "button_experience": "Explore My Journey",
    "button_projects": "View My Projects",
    "title_tecnologies": "Technologies I Master",
    "title_experience": "My Path to Here",
    "title_projects": "Experience in Action",
    "title_on_ex": "Senior Fullstack Developer | React, Python, and Django",
    "present": "Present",
    "expand_btn": "Read more",
    "retract_btn": "Show less",
    "description_on": "Currently, I am working on the development of an innovative platform that helps petrophysicists in the interpretation of oil wells using Artificial Intelligence and Machine Learning. My main responsibility is leading the front-end development of the application, ensuring intuitive and efficient interfaces, as well as integrating APIs that support communication between the platform's modules, contributing to a quick and accurate data analysis.",
    "title_plusoft_ex": "Python Developer | Python, Django, and JS",
    "description_plusoft": "I worked on the iCustomer project at Plusoft, a platform that integrated user interactions on social networks with company clients via API. I was responsible for both maintaining the system and implementing new features, developed based on suggestions from clients and the internal team. I contributed to ensuring the platform's stability, performance, and continuous evolution, always looking for efficient solutions aligned with users' needs.",
    "title_roma_ex": "Automation and Machine Learning Analyst | VBA & Python",
    "description_roma": "At Grupo Roma, I worked on automating systems, developing Python and VBA scripts to automate customer data insertion into the company's internal system. I worked with various data sources, such as Excel spreadsheets, PDF, and TXT files, optimizing internal processes and facilitating the accountants' work. Additionally, I provided external services, developing custom microsystems for small businesses, always focusing on efficiency, accuracy, and automation of repetitive tasks.",
    "title_free_ex": "Freelance Developer | Fullstack",
    "description_freelancer": "With over 5 years of experience, I create robust, scalable, and intuitive web applications, combining elegant front-end interfaces with solid back-end architectures. Specialized in React.js, JavaScript, Python, Django, Docker, and API integration, I help businesses achieve their goals through tailored solutions, agile deploys, and continuous support. If you're looking for someone to turn your idea into a digital reality, I'm ready for the challenge.",
    "title_freelancer": "Freelance Developer",
    "skills": "Skills",
    "explore_project": "Explore the Project",
    "project_details_wellnova_title": "Petrophysical Analysis with AI",
    "project_details_wellnova": "The Wellnova platform was developed to help petrophysicists interpret cement integrity in oil wells. The project evolved to include interactive log visualization, advanced simulations, and other essential features, providing an intuitive and efficient experience for users. In this project, I am responsible for front-end development and API integration.",
    "project_details_digitalpm_title": "Project Management",
    "project_details_digitalpm": "The Project Manager was developed to meet the high demand and efficient management of R&D projects at Ouronova. The platform allows managers to handle both the financial and team aspects of the project, complementing human resources functions. Additionally, the system enables performance evaluations, continuous feedback, and full control of project progress, including strict management of deadlines and deliveries.",
    "project_details_decor_title": "Portfolio for Architects",
    "project_details_decor": "Decor was conceived as a social network aimed at architects, interior designers, landscapers, and other professionals in the field, providing an exclusive platform to connect users with these specialists. On this platform, users can view the professional's projects, along with the region they serve. We also implemented, through a database, the functionality that allows professionals to promote their work using email marketing and other methods, with a focus on specific regions. Additionally, we integrated partner stores that are part of the professional's portfolio, allowing users to view furniture and other items, with the option to directly access the store's link to make a purchase. In this project, I worked as a full-stack developer, collaborating with a UX/UI designer who designed the platform alongside the client.",

    "repository": "Repositories",
    "text_vite": "Once I discovered Vite, it became hard to go back. The development speed, instant hot reload, and lightweight build made all the difference in my workflow. With it, I stopped wasting time on unnecessary waits and focused on what really matters: developing the application. Now, all my React projects start with Vite, and the experience has never been smoother.",
    "text_react": "In projects where I only work on the front-end and deal with APIs, React is my choice due to its agility in creating dynamic interfaces and ease of integration with back-end. The declarative state management and component-based structure make maintenance and scalability simpler. Additionally, its large community and documentation ensure fast development without hassle.",
    "text_js": "I enjoy using JavaScript for both front-end interactions and manipulating data sent to the back-end. In direct interactions with HTML + Django, I use JS to manage and send data efficiently. Moreover, in projects with JS libraries, I can perform validations, dynamically manipulate elements, and even integrate the front with APIs smoothly and quickly. JS is crucial as it enables building a more interactive experience and ensures full control over data flowing between the front and back.",
    "text_ts": "I started using TypeScript in freelance projects and also in migrating existing systems to a more robust and secure code. The first thing that attracted me to TypeScript was the ability to add a more solid structure to the code. Unlike JavaScript, which is more flexible and allows writing code in various ways, TypeScript brings a more organized approach with clear rules. This extra control helped improve code clarity and reduce errors during development, especially in more complex projects.",
    "text_ns": "I’ve worked with Next.js, primarily maintaining existing systems and integrating with Django back-end. Next.js made creating dynamic and optimized interfaces easier, while integration with Django allowed for efficient communication between the front-end and back-end. Combining the two frameworks helped deliver fast, scalable, and well-structured systems, ensuring good performance on both the client and server side.",
    "text_bootstrap": "Bootstrap is my go-to CSS library, and I always use it when possible, mainly for its responsiveness and ease of integration into systems. With Bootstrap, I can create flexible layouts that adapt well to different screen sizes, improving the user experience. Additionally, component manipulation and customization are straightforward, speeding up development. The robust documentation and active community are also great advantages, ensuring any doubts are easily resolved. For me, Bootstrap is a safe choice for quick projects with good performance.",
    "text_tailwind": "I started using Tailwind CSS recently in my freelance projects to speed up development. The utility class approach makes quick and direct customization in HTML easier without needing to write much CSS. This accelerates the process and makes code maintenance simpler. Integration with other frameworks is smooth, and its comprehensive documentation makes implementation even easier.",
    "text_python": "Python was my first practical language, with which I began working. I started my career as a data analyst, focusing mainly on data analysis and process automation. This experience provided a solid foundation for understanding data flow and optimizing operations. Over time, I moved into development, becoming a full-stack developer, and applied all the knowledge I gained in Python to implement efficient and scalable solutions in my projects.",
    "text_nodejs": "With Node.js, my experience was mainly focused on system maintenance, where I received client requests and solved performance optimization issues. This experience helped me deeply understand user needs and improve system efficiency, ensuring better performance and a smoother experience.",
    "text_django": "I started with Django by maintaining systems, but currently, my focus is back-end development, especially integrating front-end via APIs. In my personal projects, I prefer using Django as the back-end due to the ease of working with Python libraries, integrating databases, and quickly creating high-quality CRDs. Its robust framework and the simplicity of implementing essential features make Django an efficient choice for developing complete and scalable systems.",
    "text_docker": "I use Docker primarily when the application involves multiple processes, and it is necessary to package the app to facilitate its execution in different environments. This tool is especially useful when maintaining systems, as it allows for efficient isolation and integration of components, ensuring that the production environment is consistent and easy to replicate.",
    "text_git": "I use Git in all my projects because it provides efficient version control and facilitates team collaboration. With Git, I can manage code changes in an organized way, ensuring that version history is always accessible and allowing me to revert modifications when necessary. This practice is essential for maintaining code quality and integrity during development.",
    "text_kubernets": "I worked with Kubernetes handling system maintenance and client requests. In this context, I was responsible for managing and orchestrating containers, ensuring that systems were always available and operating efficiently. The experience with Kubernetes allowed me to optimize application performance and resolve scalability and resource management issues.",
    "text_github": "I use GitHub as my main repository due to its excellent version control and the ease it offers. The platform facilitates team collaboration, allowing code reviews with pull requests, and integrates easily with CI/CD tools for test and deployment automation. GitHub also offers an intuitive interface for project management and is a robust tool for keeping the code organized and accessible.",
    "text_bitbuket": "I’ve used Bitbucket as an enterprise repository at some of the companies I’ve worked for. The platform offered a robust solution for version control and team collaboration, with easy integration into CI/CD tools. Additionally, Bitbucket enabled efficient project management with features like branching and pull requests, essential for ensuring code quality and organization.",
    "level_basic": "Basic",
    "level_inter": "Intermediate",
    "level_advan": "Advanced",
    "link_to_project": "See the Result",
    "link_unavailable":"Temporarily Unavailable"


    },

  "es": {
    "name": "Paulo Hasa",
    "greeting": "¡Hola! Soy",
    "professional": "Desarrollador",
    "fullstack": "Full Stack",
    "frontend": "Front-end",
    "backend": "Back-end",
    "home": "Inicio",
    "about": "Sobre mí",
    "project": "Proyectos",
    "contact": "Contacto",
    "experience": "Experiencia",
    "about_me_one": "Soy desarrollador full stack con más de 5 años de experiencia en desarrollo de software, con fuerte enfoque en front-end, back-end e integración de APIs. A lo largo de mi carrera, he trabajado con principios de DevOps, ayudando a equipos a optimizar procesos e implementaciones. Aunque mi enfoque principal no es la base de datos, tengo conocimientos en el área y siempre estoy buscando expandir mis habilidades.",
    "about_me_two": "He tenido la oportunidad de trabajar tanto en empresas como freelance, lo que me ha permitido enfrentar diferentes desafíos y necesidades de los clientes. Una experiencia destacada fue mi trabajo en una oficina de contabilidad, donde trabajé durante más de un año con aprendizaje automático y automatización de procesos, ayudando a optimizar y transformar los flujos de trabajo internos.",
    "button_experience": "Explora Mi Trayectoria",
    "button_projects": "Accede a Mis Proyectos",
    "title_tecnologies": "Tecnologías que Manejo",
    "title_experience": "Mi Camino hasta Aquí",
    "title_projects": "Experiencia en Acción",
    "title_on_ex": "Desarrollador Fullstack Senior | React, Python y Django",
    "present": "Actual",
    "expand_btn": "Seguir leyendo",
    "retract_btn": "Ver menos",
    "description_on": "Actualmente, estoy trabajando en el desarrollo de una plataforma innovadora que ayuda a los petrofísicos en la interpretación de pozos de petróleo mediante Inteligencia Artificial y Aprendizaje Automático. Mi principal responsabilidad es liderar el desarrollo del front-end de la aplicación, asegurando interfaces intuitivas y eficientes, además de integrar APIs que apoyan la comunicación entre los módulos de la plataforma, contribuyendo a un análisis rápido y preciso de los datos.",
    "title_plusoft_ex": "Desarrollador Python | Python, Django y JS",
    "description_plusoft": "Trabajé en el proyecto iCustomer de Plusoft, una plataforma que integraba, a través de API, las interacciones de los usuarios en redes sociales con los clientes de la empresa. Fui responsable tanto del mantenimiento del sistema como de la implementación de nuevas funcionalidades, desarrolladas a partir de sugerencias de los clientes y el equipo interno. Contribuí a garantizar la estabilidad, el rendimiento y la evolución continua de la plataforma, siempre buscando soluciones eficientes y alineadas con las necesidades de los usuarios.",
    "title_roma_ex": "Analista de Automatización y Machine Learning | VBA & Python",
    "description_roma": "En el Grupo Roma, trabajé en la automatización de sistemas, desarrollando scripts en Python y VBA para automatizar la inserción de datos de clientes en el sistema interno de la empresa. Trabajé con diversas fuentes de datos, como hojas de Excel, archivos PDF y TXT, optimizando procesos internos y facilitando el trabajo de los contadores. Además, presté servicios externos, desarrollando microsistemas a medida para pequeñas empresas, siempre enfocándome en eficiencia, precisión y automatización de tareas repetitivas.",
    "title_free_ex": "Desarrollador Freelance | Fullstack",
    "description_freelancer": "Con más de 5 años de experiencia, creo aplicaciones web robustas, escalables e intuitivas, combinando interfaces elegantes en el front-end con arquitecturas sólidas en el back-end. Especializado en React.js, JavaScript, Python, Django, Docker e integración de APIs, ayudo a las empresas a alcanzar sus objetivos a través de soluciones a medida, despliegues ágiles y soporte continuo. Si buscas a alguien para transformar tu idea en una realidad digital, estoy listo para el desafío.",
    "title_freelancer": "Desarrollador Autónomo",
    "skills": "Habilidades",
    "explore_project": "Explora el Proyecto",
    "project_details_wellnova_title": "Análisis Petrofísico con IA",
    "project_details_wellnova": "La plataforma Wellnova fue desarrollada para ayudar a los petrofísicos en la interpretación de la integridad del cemento en pozos de petróleo. El proyecto evolucionó para incluir visualización interactiva de logs, simulaciones avanzadas y otras funcionalidades esenciales, proporcionando una experiencia intuitiva y eficiente para los usuarios. En este proyecto, soy responsable del desarrollo del front-end y la integración de APIs.",
    "project_details_digitalpm_title": "Gestión de Proyectos",
    "project_details_digitalpm": "El Project Manager fue desarrollado para atender la alta demanda y la gestión eficiente de proyectos de I+D en Ouronova. La plataforma permite a los gestores administrar tanto la parte financiera como el equipo del proyecto, complementando las funciones de recursos humanos. Además, el sistema permite realizar evaluaciones de desempeño, retroalimentación continua y el control total del progreso de los proyectos, incluyendo la gestión rigurosa de plazos y entregas.",
    "project_details_decor_title": "Portafolio para Arquitectos",
    "project_details_decor": "Decor fue concebida como una red social dirigida a arquitectos, diseñadores de interiores, paisajistas y otros profesionales del área, proporcionando una plataforma exclusiva para conectar a los usuarios con estos especialistas. En esta plataforma, el usuario puede ver los proyectos del profesional, junto con la región en la que él trabaja. También implementamos, a través de una base de datos, la funcionalidad que permite a los profesionales promocionar su trabajo mediante marketing por correo electrónico y otros medios, enfocados en regiones específicas. Además, integramos tiendas asociadas que forman parte del portafolio del profesional, permitiendo que el usuario vea muebles y otros artículos, con la opción de acceder directamente al enlace de la tienda para realizar la compra. En este proyecto, trabajé como desarrollador full-stack, colaborando con una diseñadora UX/UI que ideó la plataforma junto con el cliente.",
    
    "repository": "Repositorios",
    "text_vite": "Después de conocer Vite, fue difícil volver atrás. La velocidad en el desarrollo, el hot reload instantáneo y la ligereza en la construcción hicieron toda la diferencia en mi flujo de trabajo. Con él, dejé de perder tiempo con esperas innecesarias y me enfoqué en lo que realmente importa: el desarrollo de la aplicación. Hoy en día, todos mis proyectos React comienzan con Vite, y la experiencia nunca ha sido tan fluida.",
    "text_react": "En proyectos donde solo trabajo en el front-end y con APIs, React es mi elección por su agilidad en la creación de interfaces dinámicas y la facilidad de integración con el back-end. La gestión del estado de manera declarativa y la estructura basada en componentes hacen que el mantenimiento y la escalabilidad sean más sencillos. Además, su gran comunidad y documentación garantizan un desarrollo rápido y sin dificultades.",
    "text_js": "Me gusta utilizar JavaScript tanto para interacciones en el front-end como para manipular datos enviados al back-end. En interacciones directas con HTML + Django, utilizo JS para gestionar y enviar datos de manera eficiente. Además, en proyectos con bibliotecas JS, puedo realizar validaciones, manipulaciones dinámicas de elementos e incluso integrar el front-end con APIs de forma fluida y ágil. JS es fundamental, ya que permite construir una experiencia más interactiva, además de garantizar el control total sobre los datos que circulan entre el front y el back.",
    "text_ts": "Comencé a usar TypeScript en proyectos freelance y también en la migración de sistemas existentes a un código más robusto y seguro. Lo primero que me atrajo de TypeScript fue la capacidad de agregar una estructura más sólida al código. A diferencia de JavaScript, que es más flexible y permite escribir código de diversas maneras, TypeScript ofrece un enfoque más organizado con reglas claras. Este control adicional ayudó a mejorar la claridad del código y redujo la cantidad de errores durante el desarrollo, especialmente en proyectos más complejos.",
    "text_ns": "He trabajado con Next.js, principalmente dando mantenimiento a sistemas existentes e integrando con back-end en Django. Next.js facilitó mucho el proceso de creación de interfaces dinámicas y optimizadas, mientras que la integración con Django permitió una comunicación eficiente entre el front-end y el back-end. La combinación de ambos frameworks ayudó a entregar sistemas rápidos, escalables y bien estructurados, garantizando un buen rendimiento tanto del lado del cliente como del servidor.",
    "text_bootstrap": "Bootstrap es mi biblioteca CSS principal, y siempre la utilizo cuando es posible, principalmente por su capacidad de respuesta y la facilidad de integración en sistemas. Con Bootstrap, puedo crear diseños flexibles que se adaptan bien a diferentes tamaños de pantalla, mejorando la experiencia del usuario. Además, la manipulación y personalización de los componentes es muy sencilla, lo que acelera el desarrollo. La documentación robusta y la comunidad activa también son grandes ventajas, garantizando que cualquier duda sea fácilmente resuelta. Para mí, Bootstrap es una opción segura para proyectos rápidos y con buen rendimiento.",
    "text_tailwind": "Comencé a usar Tailwind CSS recientemente en mis proyectos freelance para agilizar el desarrollo. El enfoque de clases utilitarias facilita la personalización rápida y directa en HTML, sin necesidad de escribir mucho CSS. Esto acelera el proceso y hace que el mantenimiento del código sea más sencillo. La integración con otros frameworks es fluida y su documentación completa hace que la implementación sea aún más fácil.",
    "text_python": "Python fue mi primer lenguaje práctico con el que comencé a trabajar. Inicié mi carrera como analista de datos, enfocándome principalmente en el análisis de datos y la automatización de procesos. Esta experiencia me proporcionó una base sólida para entender el flujo de datos y optimizar las operaciones. Con el tiempo, me pasé al área de desarrollo, convirtiéndome en un desarrollador fullstack, y aproveché todo el conocimiento adquirido en Python para implementar soluciones eficientes y escalables en mis proyectos.",
    "text_nodejs": "Con Node.js, mi experiencia se centró principalmente en el mantenimiento de sistemas, donde recibía tareas de clientes y resolvía problemas relacionados con la optimización del rendimiento. Esta experiencia me ayudó a comprender profundamente las necesidades de los usuarios y mejorar la eficiencia de los sistemas, garantizando un mejor rendimiento y una experiencia más fluida.",
    "text_django": "Comencé con Django trabajando en el mantenimiento de sistemas, pero actualmente mi enfoque está en el desarrollo back-end, especialmente integrando el front-end mediante APIs. En mis proyectos personales, prefiero usar Django como back-end debido a la facilidad de trabajar con bibliotecas Python, la integración con bases de datos y la agilidad para crear CRDs de alta calidad. Su marco robusto y la simplicidad para implementar funcionalidades esenciales hacen de Django una opción eficiente para desarrollar sistemas completos y escalables.",
    "text_docker": "Utilizo Docker principalmente cuando la aplicación involucra múltiples procesos y es necesario empaquetar la aplicación para facilitar su ejecución en diferentes entornos. Esta herramienta es especialmente útil cuando mantengo sistemas, ya que permite aislar e integrar componentes de manera eficiente, asegurando que el entorno de producción sea consistente y fácil de replicar.",
    "text_git": "Utilizo Git en todos mis proyectos porque ofrece un control eficiente de versiones y facilita la colaboración en equipo. Con Git, puedo gestionar los cambios en el código de manera organizada, garantizando que el historial de versiones esté siempre accesible y permitiendo revertir modificaciones cuando sea necesario. Esta práctica es esencial para mantener la calidad e integridad del código durante el desarrollo.",
    "text_kubernets": "Trabajé con Kubernetes realizando mantenimiento de sistemas y atendiendo solicitudes de clientes. En este contexto, fui responsable de gestionar y orquestar contenedores, asegurando que los sistemas estuvieran siempre disponibles y operando de manera eficiente. La experiencia con Kubernetes me permitió optimizar el rendimiento de las aplicaciones y resolver problemas relacionados con la escalabilidad y la gestión de recursos.",
    "text_github": "Utilizo GitHub como mi repositorio principal debido a su excelente control de versiones y a las facilidades que ofrece. La plataforma facilita la colaboración en equipo, permitiendo revisiones de código con pull requests, e integrando fácilmente con herramientas de CI/CD para automatización de pruebas y despliegues. GitHub también ofrece una interfaz intuitiva para la gestión de proyectos y es una herramienta robusta para mantener el código organizado y accesible.",
    "text_bitbuket": "He utilizado Bitbucket como repositorio empresarial en algunas de las empresas en las que he trabajado. La plataforma ofreció una solución robusta para el control de versiones y la colaboración en equipo, con fácil integración en herramientas de CI/CD. Además, Bitbucket permitió una gestión eficiente de proyectos, con características como branching y pull requests, esenciales para garantizar la calidad y organización del código.",
    "level_basic": "Básico",
    "level_inter": "Intermedio",
    "level_advan": "Avanzado",
    "link_to_project": "Ver el Resultado",
    "link_unavailable":"emporalmente Indisponible"


    }
}


